Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyAttachedType Property
 Cannot copy attached detail group type without copying the model group type it refers to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyAttachedType { get; }
Public Shared ReadOnly Property CannotCopyAttachedType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyAttachedType {
	FailureDefinitionId^ get ();
}
static member CannotCopyAttachedType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace